<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join:-relating-index" data-toc-modified-id="Join:-relating-index-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Join: relating index</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

In [95]:
import pandas as pd
import numpy as np

In [96]:
df = pd.read_csv("../datasets/employees.csv")

## Data aggregation

`groupby, pivot table & cross_tab`

### groupby
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

`df[subset].groupby(category).aggregation()`

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [98]:
df.sample(3)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
718,45,No,Non-Travel,248,Research & Development,23,2,Life Sciences,1,1002,...,3,80,1,9,2,3,9,8,0,8
1243,45,No,Travel_Rarely,176,Human Resources,4,3,Life Sciences,1,1744,...,3,80,2,9,2,4,5,0,0,3
1212,34,No,Travel_Rarely,678,Research & Development,19,3,Life Sciences,1,1701,...,2,80,0,10,3,3,10,9,8,7

`groupby the departments and their mean age`

In [105]:
df["Department"].unique()

array(['Sales', 'Research & Development', 'Human Resources'], dtype=object)

In [112]:
df[["Department", "Age"]].groupbyupby(by="Department").agg("mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [117]:
#df[["Department", "Age"]].groupby(by="Department").agg(lambda x: )
# getting the percentage as well as the average

`groupby the departments and their maximum age`

In [113]:
df[["Department", "Age"]].groupby(by="Department").agg("max")

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`groupby the departments and their min age`

In [114]:
df[["Department", "Age"]].groupby(by="Department").agg("min")

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`groupby: 2+`: Different Education Fields and their Mean Salaries in each of the Department

In [118]:
df.sample()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
337,29,No,Travel_Rarely,738,Research & Development,9,5,Other,1,455,...,3,80,0,4,2,3,3,2,2,2

In [119]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [ ]:
# gropby = department & education field
# department, education field & monthly rate

# agg (mean)

In [132]:
df[["Department", "EducationField","MonthlyRate"]]

                  Department EducationField  MonthlyRate
0                      Sales  Life Sciences        19479
1     Research & Development  Life Sciences        24907
2     Research & Development          Other         2396
3     Research & Development  Life Sciences        23159
4     Research & Development        Medical        16632
...                      ...            ...          ...
1465  Research & Development        Medical        12290
1466  Research & Development        Medical        21457
1467  Research & Development  Life Sciences         5174
1468                   Sales        Medical        13243
1469  Research & Development        Medical        10228

[1470 rows x 3 columns]

In [133]:
df_index = df[["Department", "EducationField","MonthlyRate"]].groupby(by=["Department", "EducationField"]).agg({"MonthlyRate":"mean"})
df_index

                                          MonthlyRate
Department             EducationField
Human Resources        Human Resources   14810.740741
                       Life Sciences     12813.875000
                       Medical           12668.230769
                       Other              9275.000000
                       Technical Degree  13158.500000
Research & Development Life Sciences     14594.704545
                       Medical           14163.603306
                       Other             13051.765625
                       Technical Degree  14142.393617
Sales                  Life Sciences     14523.786667
                       Marketing         14076.943396
                       Medical           15077.625000
                       Other             15004.400000
                       Technical Degree  14522.029412

In [135]:
df[["Department", "EducationField","MonthlyRate", "StandardHours"]].groupby(by=["Department", "EducationField"]).agg({"MonthlyRate":"mean", "StandardHours":"max"})

                                          MonthlyRate  StandardHours
Department             EducationField
Human Resources        Human Resources   14810.740741             80
                       Life Sciences     12813.875000             80
                       Medical           12668.230769             80
                       Other              9275.000000             80
                       Technical Degree  13158.500000             80
Research & Development Life Sciences     14594.704545             80
                       Medical           14163.603306             80
                       Other             13051.765625             80
                       Technical Degree  14142.393617             80
Sales                  Life Sciences     14523.786667             80
                       Marketing         14076.943396             80
                       Medical           15077.625000             80
                       Other             15004.400000             80
                       Technical Degree  14522.029412             80

In [140]:
df[["Department", "EducationField","MonthlyRate", "StandardHours", "Age"]].groupby(by=["Department", "EducationField"]).agg("mean")

                                          MonthlyRate  StandardHours  \
Department             EducationField
Human Resources        Human Resources   14810.740741           80.0
                       Life Sciences     12813.875000           80.0
                       Medical           12668.230769           80.0
                       Other              9275.000000           80.0
                       Technical Degree  13158.500000           80.0
Research & Development Life Sciences     14594.704545           80.0
                       Medical           14163.603306           80.0
                       Other             13051.765625           80.0
                       Technical Degree  14142.393617           80.0
Sales                  Life Sciences     14523.786667           80.0
                       Marketing         14076.943396           80.0
                       Medical           15077.625000           80.0
                       Other             15004.400000           80.0
                       Technical Degree  14522.029412           80.0

                                               Age
Department             EducationField
Human Resources        Human Resources   37.037037
                       Life Sciences     39.375000
                       Medical           39.846154
                       Other             34.666667
                       Technical Degree  32.500000
Research & Development Life Sciences     36.997727
                       Medical           37.242424
                       Other             36.187500
                       Technical Degree  37.063830
Sales                  Life Sciences     37.186667
                       Marketing         37.924528
                       Medical           34.727273
                       Other             32.000000
                       Technical Degree  33.941176

In [ ]:
# {"Age": "mean", "MonthlyRate":"mean", "StandardHours":"max"}
# {"Age": "mean", "MonthlyRate":"mean", "StandardHours":"mean"} -> "mean"

In [ ]:
# Andrés wishlist: grouping by age IN ranges
    # 1. new column: group A if < 18
    # 2. built-it method pd.cut()

In [130]:
len(df_index.index)

14

In [131]:
df_index.index

MultiIndex([(       'Human Resources',  'Human Resources'),
            (       'Human Resources',    'Life Sciences'),
            (       'Human Resources',          'Medical'),
            (       'Human Resources',            'Other'),
            (       'Human Resources', 'Technical Degree'),
            ('Research & Development',    'Life Sciences'),
            ('Research & Development',          'Medical'),
            ('Research & Development',            'Other'),
            ('Research & Development', 'Technical Degree'),
            (                 'Sales',    'Life Sciences'),
            (                 'Sales',        'Marketing'),
            (                 'Sales',          'Medical'),
            (                 'Sales',            'Other'),
            (                 'Sales', 'Technical Degree')],
           names=['Department', 'EducationField'])

In [ ]:
# multiindex: https://pandas.pydata.org/docs/user_guide/advanced.html

`more fields`

#### groupby & aggregate

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

### Pivot Tables

[groupby vs pivot table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b?source=userActivityShare-4c6d9a33c6-1674605913&_branch_match_id=1146490620103499300&_branch_referrer=H4sIAAAAAAAAA8soKSkottLXz8nMy9bLTU3JLM3VS87P1TfKCvCtKvOvCCpPAgAN4ht%2FIwAAAA%3D%3D)

```pivot_table(df, values=None, index=None, columns=None, aggfunc='mean', ...)```

* We can create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

`pivot table`: the department and their mean ages

In [141]:
df.sample()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
254,29,No,Travel_Rarely,1247,Sales,20,2,Marketing,1,349,...,4,80,1,10,2,3,3,2,0,2

In [143]:
df.pivot_table(values = "Age",
                index = "Department",
                aggfunc = "mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`pivot table`: the department and their max ages

In [144]:
df.pivot_table(values = "Age",
                index = "Department",
                aggfunc = "max")

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`pivot table`: the department and their min ages

In [145]:
df.pivot_table(values = "Age",
                index = "Department",
                aggfunc = "min")

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`pivot table`: the department and their median age

In [146]:
df.pivot_table(values = "Age",
                index = "Department",
                aggfunc = "median")

                        Age
Department
Human Resources          37
Research & Development   36
Sales                    35

`multi-index pivot table`: Department and Education Field and check the maximum salary values of employees

In [149]:
df.pivot_table(values = "Age",
                index = ["Department", "EducationField"],
                aggfunc = "mean")

                                               Age
Department             EducationField
Human Resources        Human Resources   37.037037
                       Life Sciences     39.375000
                       Medical           39.846154
                       Other             34.666667
                       Technical Degree  32.500000
Research & Development Life Sciences     36.997727
                       Medical           37.242424
                       Other             36.187500
                       Technical Degree  37.063830
Sales                  Life Sciences     37.186667
                       Marketing         37.924528
                       Medical           34.727273
                       Other             32.000000
                       Technical Degree  33.941176

### Differences between pivot table and groupby function

`groupby`: team mean age by team abbreviation & season.

`pivot_table`: team mean age by team abbreviation & season.

### crosstab

* Compute a simple cross tabulation of two (or more) factors. By default computes a frequency table of the factors unless an array of values and an aggregation function are passed. Usually used to see the frequency of two qualitative variables: how many times the value of one column happens in the other one

```pd.crosstab(df[column1], df[column2])```

In [150]:
df.sample()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
1262,43,Yes,Travel_Frequently,807,Research & Development,17,3,Technical Degree,1,1767,...,4,80,1,6,4,3,1,0,0,0

In [156]:
pd.crosstab(df["BusinessTravel"], df["Department"]) # count

Department         Human Resources  Research & Development  Sales
BusinessTravel
Non-Travel                       6                      97     47
Travel_Frequently               11                     182     84
Travel_Rarely                   46                     682    315

In [155]:
pd.crosstab(df["BusinessTravel"], df["Department"], df["DailyRate"], aggfunc="mean")

Department         Human Resources  Research & Development       Sales
BusinessTravel
Non-Travel              651.500000              822.587629  826.468085
Travel_Frequently       935.363636              779.181319  803.071429
Travel_Rarely           720.630435              811.997067  795.622222

In [159]:
pd.crosstab(df["BusinessTravel"], [df["Department"], df["Attrition"]], df["DailyRate"], aggfunc="mean")

Department        Human Resources         Research & Development              \
Attrition                      No     Yes                     No         Yes
BusinessTravel
Non-Travel             651.500000     NaN             833.797753  697.875000
Travel_Frequently      991.142857  837.75             801.324138  692.405405
Travel_Rarely          723.710526  706.00             815.873737  785.829545

Department              Sales
Attrition                  No          Yes
BusinessTravel
Non-Travel         796.837209  1145.000000
Travel_Frequently  861.321429   686.571429
Travel_Rarely      807.619608   744.633333

In [161]:
pd.crosstab([df["BusinessTravel"], df["Attrition"]], df["Department"], df["DailyRate"], aggfunc="mean")

Department                   Human Resources  Research & Development  \
BusinessTravel    Attrition
Non-Travel        No              651.500000              833.797753
                  Yes                    NaN              697.875000
Travel_Frequently No              991.142857              801.324138
                  Yes             837.750000              692.405405
Travel_Rarely     No              723.710526              815.873737
                  Yes             706.000000              785.829545

Department                         Sales
BusinessTravel    Attrition
Non-Travel        No          796.837209
                  Yes        1145.000000
Travel_Frequently No          861.321429
                  Yes         686.571429
Travel_Rarely     No          807.619608
                  Yes         744.633333

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Data combination: mixing dataframes

- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [162]:
# Concat: put things things together side to side (up & bottom)
# merge: 
    # commomn column, and mixing the rows based on the value of the common column

# join in pandas
    # put tables together based on the value of index

### Concat: two things together
We join dataframes along axis 0 one below the other. Align columns by label.

In [163]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')
df.sample()

         age gender occupation zip_code
user_id
740       25      F   educator    22206

In [164]:
df.shape[0]

943

In [168]:
first_df = df.sample(frac=0.1)
second_df = df.sample(frac=0.1)

In [166]:
first_df.shape[0]

94

In [169]:
second_df.shape[0]

94

#### Concatenating on axis 0 (rows)

In [174]:
concatenated_axis_zero = pd.concat([first_df, second_df], axis=0, keys=["origin one", "origin second"])
concatenated_axis_zero

                       age gender     occupation zip_code
              user_id
origin one    249       25      M        student    84103
              695       26      M         writer    38115
              528       18      M        student    55104
              597       23      M          other    84116
              698       28      F     programmer    06906
...                    ...    ...            ...      ...
origin second 426       55      M       educator    01602
              97        43      M         artist    98006
              518       49      F         writer    99709
              447       30      M  administrator    55113
              815       32      M          other    28806

[188 rows x 4 columns]

#### Concatenating on axis 1 (columns)

In [175]:
concatenated_axis_one = pd.concat([first_df, second_df], axis=1, keys=["This comes from 1st", "This comes from the 2nd"])
concatenated_axis_one

        This comes from 1st                                 \
                        age gender     occupation zip_code
user_id
5                       NaN    NaN            NaN      NaN
8                      36.0      M  administrator    05201
12                     28.0      F          other    06405
19                     40.0      M      librarian    02138
23                      NaN    NaN            NaN      NaN
...                     ...    ...            ...      ...
917                     NaN    NaN            NaN      NaN
920                    30.0      F         artist    90008
921                     NaN    NaN            NaN      NaN
938                    38.0      F     technician    55038
940                    32.0      M  administrator    02215

        This comes from the 2nd
                            age gender occupation zip_code
user_id
5                          33.0      F      other    15213
8                           NaN    NaN        NaN      NaN
12                          NaN    NaN        NaN      NaN
19                          NaN    NaN        NaN      NaN
23                         30.0      F     artist    48197
...                         ...    ...        ...      ...
917                        22.0      F    student    20006
920                         NaN    NaN        NaN      NaN
921                        20.0      F    student    98801
938                         NaN    NaN        NaN      NaN
940                         NaN    NaN        NaN      NaN

[185 rows x 8 columns]

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge: related columns

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

In [177]:
from IPython.display import display_html

In [179]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [180]:
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [59]:
# merge, default is inner

result = pd.merge(df1, df2)
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

#### LEFT Merge

In [20]:
left_merge = pd.merge(df1, df2, how="left")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
left_merge = left_merge.style.set_table_attributes("style='display:inline'").set_caption("left_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [181]:
display_html(left_merge._repr_html_(), raw=True)

,key1,key2,A,B,C,D
0,K0,K0,A0,B0,C0,D0
1,K0,K1,A1,B1,nan,nan
2,K1,K0,A2,B2,C1,D1
3,K1,K0,A2,B2,C2,D2
4,K2,K1,A3,B3,nan,nan

#### RIGHT Merge

In [60]:
right_merge = pd.merge(df1, df2, how="right")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
right_merge = right_merge.style.set_table_attributes("style='display:inline'").set_caption("right_merge")

display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(),raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [24]:
display_html(right_merge._repr_html_(), raw=True)

,key1,key2,A,B,C,D
0,K0,K0,A0,B0,C0,D0
1,K1,K0,A2,B2,C1,D1
2,K1,K0,A2,B2,C2,D2
3,K2,K0,nan,nan,C3,D3

#### INNER Merge

In [61]:
inner_merge = pd.merge(df1, df2, how="inner")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
inner_merge = inner_merge.style.set_table_attributes("style='display:inline'").set_caption("inner_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [62]:
display_html(inner_merge._repr_html_(), raw=True)

,key1,key2,A,B,C,D
0,K0,K0,A0,B0,C0,D0
1,K1,K0,A2,B2,C1,D1
2,K1,K0,A2,B2,C2,D2

#### OUTER Merge

In [63]:
outer_merge = pd.merge(df1, df2, how="outer")

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
outer_merge = outer_merge.style.set_table_attributes("style='display:inline'").set_caption("outer_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [64]:
display_html(outer_merge._repr_html_(), raw=True)

,key1,key2,A,B,C,D
0,K0,K0,A0,B0,C0,D0
1,K0,K1,A1,B1,nan,nan
2,K1,K0,A2,B2,C1,D1
3,K1,K0,A2,B2,C2,D2
4,K2,K1,A3,B3,nan,nan
5,K2,K0,nan,nan,C3,D3

### Merging & Concatenating in two different columns

In [65]:
df1_docs = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2_docs = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [66]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

#### Concatenating in two different columns

In [67]:
concat_docs = pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = concat_docs.style.set_table_attributes("style='display:inline'").set_caption('concat_docs')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

In [68]:
display_html(merge_styler._repr_html_(), raw=True)

#### Merging in two different columns

In [69]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

In [70]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_fromleft", "_fromright"])

In [71]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_from_left", "_from_right"])


df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = merge_docs.style.set_table_attributes("style='display:inline'").set_caption('merge_docs')

display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,lkey,value
0,foo,1
1,bar,2
2,baz,3
3,foo,5
,rkey,value
0,foo,5
1,bar,6
2,baz,7
3,foo,8

In [72]:
display_html(merge_styler._repr_html_(), raw=True)

,lkey,value_from_left,rkey,value_from_right
0,foo,1,foo,5
1,foo,1,foo,8
2,foo,5,foo,5
3,foo,5,foo,8
4,bar,2,bar,6
5,baz,3,baz,7

In [73]:
# suffixes: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [74]:
# concat: putting things together
# join/merge: putting things together THAT ARE RELATED
    # related info in the same place -> reduces redundancy

### Join: relating index
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [182]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [183]:
left_df = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right_df = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [184]:
df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,A,B
K0,A0,B0
K1,A1,B1
K2,A2,B2
,C,D
K0,C0,D0
K2,C2,D2
K3,C3,D3

In [78]:
result = left_df.join(right_df, how="inner")

#Rendering the df's in the same line. No need to learn this code

df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('JOIN')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table>

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)